Here, I've tried it on macos using terraform installed via brew.

```sh
$ brew tap hashicorp/tap
$ brew install hashicorp/tap/terraform

$ which terraform
/opt/homebrew/bin/terraform

$ terraform --version
Terraform v1.9.7
on darwin_arm64
```

Here is the configuration. I'm using trust token instead of password, and the `config_dir` is set to `./config` just for test purposes (If not set, you can find them in `~/.config/lxc`). Once the Terraform is run, it will generate a client certificate if missing (in `./config/client.{crt,key}`), and accept the the remote LXD certificate (in `./config/servercerts/my-remote.crt`).
```hcl
terraform {
  required_providers {
    lxd = {
      source = "terraform-lxd/lxd"
      version = "2.4.0"
    }
  }
}

provider "lxd" {
  generate_client_certificates = true
  accept_remote_certificate    = true
  config_dir                   = "./config"

  remote {
    name    = "my-remote"
    address = "https://10.2.0.42:8443"
    token   = "<token>" # Generate on remote using "lxc trust config add --name my-remote --quiet"
    default = true
  }
}

resource "lxd_instance" "inst" {
  name      =  "c1"
  image     = "images:alpine/edge"
  ephemeral = true
}
```

Applying the configuration:
```sh
$ terraform init
$ terraform apply --auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # lxd_instance.inst will be created
  + resource "lxd_instance" "inst" {
      + config           = {}
      + description      = ""
      + ephemeral        = true
      + image            = "images:alpine/edge"
      + interfaces       = (known after apply)
      + ipv4_address     = (known after apply)
      + ipv6_address     = (known after apply)
      + limits           = {}
      + mac_address      = (known after apply)
      + name             = "c1"
      + profiles         = [
          + "default",
        ]
      + running          = true
      + status           = (known after apply)
      + target           = (known after apply)
      + type             = "container"
      + wait_for_network = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.
lxd_instance.inst: Creating...
lxd_instance.inst: Still creating... [10s elapsed]
lxd_instance.inst: Still creating... [20s elapsed]
lxd_instance.inst: Creation complete after 28s [name=c1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Here are the resulting certificates.
```sh
$ ls ./config 
client.crt  client.key  servercerts

$ ls ./config/servercerts 
my-remote.crt
```

I was asking if you can try adding the remote using `lxc remote add` to confirm whether the same issue issue applies using `lxc` or just using Terraform. The `lxc` can also be installed using brew (`brew install lxc`).